package com.company.lesson_04;

/**
 * Created by temap on 02.12.2017.
 * /* Хорошего не бывает много
 Ввести с клавиатуры строку и число N.
 Вывести на экран строку N раз используя цикл while.
 Пример ввода:
 абв
 2
 Пример вывода:
 абв
 абв
 */

public class Test_04 {
    public static void main(String[] args) {
        System.out.println();
    }
}
